import React from 'react'

const TermsOfServicePage = () => {
  return (
    <div className='mx-36 flex flex-col mb-32 mt-10'>
      <hr className='border-t border-gray-400 mb-4 opacity-75' />
      <div className='flex items-center text-center justify-center my-12'>
        <p className='mr-4 text-ellipsis text-lg'>ProdigyPath</p>
        <p className='text-xl font-bold'>Условия обслуживания</p>
      </div>
      <hr className='border-t border-gray-400 mb-10 w-full' />

      <div>
        <p className={'mb-4'}>
          Настоящие условия обслуживания заключаются между вами и ProdigyPath в отношении
          использования нашего приложения в отношении наших средств обучения. Заходя на
          наши веб-сайты («Услуги»), вы подтверждаете, что прочитали, поняли и согласились
          с самой последней версией настоящих Условий обслуживания («Условия»).
        </p>
        <p className={'mb-12'}>
          Мы оставляем за собой право пересматривать настоящие Условия в любое время. В
          этом случае мы опубликуем измененные Условия на этой странице и укажем дату
          последнего изменения выше. Вы соглашаетесь читать все уведомления, которые мы
          вам отправляем, и периодически проверять эту страницу на наличие обновлений
          настоящих Условий. Продолжение использования вами Услуг означает принятие
          настоящих Условий и любых их изменений. Если вы возражаете против каких-либо
          изменений, вашим единственным выходом является прекращение использования Услуг.
        </p>
        <ul className='list-none pl-4'>
          <li className={'mb-4 space-x-10'}>
            <h3 className='font-bold mb-4 '>ИСПОЛЬЗОВАНИЕ УСЛУГ</h3>
            <CustomP>
              Вы соглашаетесь с тем, что, используя наши услуги, вы соглашаетесь с
              настоящими Условиями и понимаете свои обязательства в соответствии с
              настоящими Условиями и Политикой конфиденциальности. Вы также соглашаетесь с
              тем, что вам разрешено использовать наши Услуги и вы используете их
              исключительно для своей выгоды. Мы имеем право по своему усмотрению
              прекратить любые транзакции или действия, если мы считаем, что эти действия
              нарушают настоящие Условия, Политику конфиденциальности или какие-либо
              законы. Вы можете быть уведомлены или не уведомлены о прекращении действия
              по нашему усмотрению.
            </CustomP>
            <CustomP>
              «Контент» означает все программное обеспечение, коммуникации, изображения,
              звуки и материалы, воспринимаемые или доступные из Приложений. Если иное не
              указано в письменной форме, весь наш контент принадлежит нам, контролируется
              или лицензируется нами. Контент означает все программное обеспечение,
              изображения, вопросы, решения или любые материалы, связанные с услугой и
              веб-сайтом.
            </CustomP>
            <CustomP>
              Вы соглашаетесь с тем, что весь контент является нашей единоличной и
              исключительной собственностью. Мы можем использовать весь контент для любых
              целей, в том числе для коммерческого или рекламного использования, без
              ограничений и компенсации вам. Вы соглашаетесь не копировать, не
              распространять, не публиковать и не использовать иным образом какой-либо
              Контент в нарушение прав интеллектуальной собственности. Вы заявляете и
              гарантируете, что любой Пользовательский контент, который вы отправляете,
              публикуете или отображаете через Сервисы, не нарушает авторских прав,
              патентов, товарных знаков, торговых наименований, коммерческих тайн или
              любых других личных или имущественных прав любой третьей стороны.
            </CustomP>
            <CustomP>
              Вы можете получить доступ или использовать сторонние услуги, продукты,
              ресурсы, контент или информацию, включая, помимо прочего, продукты и услуги
              («Сторонние материалы») через Сервисы. Вы признаете единоличную
              ответственность и принимаете на себя все риски, возникающие в результате
              вашего доступа к любым таким Материалам третьих лиц или их использования, и
              мы отказываемся от любой ответственности, которую вы можете понести в связи
              с вашим доступом к таким Материалам третьих лиц или их использованием. Вы
              признаете и соглашаетесь с тем, что мы: (а) не несем ответственности за
              доступность или точность таких Материалов Третьих лиц или продуктов или
              услуг, доступных из таких Материалов Третьих лиц; (б) не несете
              ответственности перед вами или любой третьей стороной за любой вред, травмы
              или убытки, понесенные в результате вашего доступа к таким Материалам
              третьих лиц или их использования; и (c) не давать никаких обещаний удалить
              Материалы третьих лиц из доступа через Сервисы. Ваша возможность получить
              доступ или ссылаться на Сторонние материалы или сторонние услуги (включая
              любые социальные сети) не подразумевает какого-либо одобрения нами Сторонних
              материалов или любых таких сторонних услуг. Любая информация, собранная
              такими сторонними поставщиками рекламы, регулируется политикой таких
              поставщиков.
            </CustomP>
          </li>
          <li className={'mb-4 space-x-10'}>
            <h3 className='font-bold mb-4 '>ИНФОРМАЦИЯ ОБ АККАУНТЕ</h3>

            <CustomP>
              <i>Условия аккаунта. </i>
              Вам может потребоваться зарегистрировать у нас учетную запись для
              предложения использования наших услуг. Вы соглашаетесь с тем, что
              предоставленная вами информация является точной, насколько вам известно. Вам
              должно быть не менее 18 лет или вы должны быть эмансипированы в соответствии
              с местной юрисдикцией. Нам потребуется определенная личная информация как
              часть вашей учетной записи. Вы соглашаетесь поддерживать точность
              информации. Неспособность поддерживать актуальную учетную запись может
              привести к невозможности использования наших услуг. Вы несете единоличную
              ответственность за все действия, происходящие в вашей учетной записи.
            </CustomP>
            <CustomP>
              <i>Использование учетной записи. </i>
              Вы соглашаетесь использовать свою учетную запись исключительно в целях
              предоставления наших услуг. Вы также соглашаетесь с тем, что не разрешаете
              третьим лицам использовать вашу учетную запись или использовать ее для
              каких-либо услуг, не связанных с
            </CustomP>
            <CustomP>
              <i>Конфиденциальность. </i>
              Условия вашей учетной записи защищены нашей политикой конфиденциальности,
              включая любые материалы, созданные пользователем, или конфиденциальную
              информацию, предоставляемую как часть вашей учетной записи. Чтобы узнать
              больше о том, как мы используем ваши данные, ознакомьтесь с нашей политикой
              конфиденциальности, которая включена в настоящее соглашение посредством
              ссылки.
            </CustomP>
          </li>
        </ul>
      </div>
    </div>
  )
}
export default TermsOfServicePage

const CustomP: React.FC<{ children: React.ReactNode }> = ({ children }) => {
  return <p className='pl-4 mb-4'>{children}</p>
}
